Tekla Open API Reference for Tekla Structures 2025
Hideable.ShouldBeHiddenFlags Enumeration
 The flag for keeping track if object should be hidden.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum ShouldBeHiddenFlags
Public Enumeration ShouldBeHiddenFlags
Members
Member name | Value | Description
ShouldNotBeHidden | 0 |  Should not be hidden, default value.
HideFromDrawingView | 1 |  To be hidden from drawing view.
HideFromDrawing | 2 |  To be hidden from drawing.
ShowInDrawingView | 3 |  To be shown in drawing view.
ShowInDrawing | 4 |  To be shown in drawing.
See Also
Reference
Tekla.Structures.Drawing Namespace